node_modules/process-nextick-args/Untitled-1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:nfe="http://www.exemplo.gov.br/nfe">
   <soapenv:Header/>
   <soapenv:Body>
      <nfe:EmissaoNotaFiscalRequest>
         <nfe:InformacoesNotaFiscal>
            <nfe:Numero>123456</nfe:Numero>
            <nfe:DataEmissao>2024-04-09</nfe:DataEmissao>
            <nfe:ValorTotal>500.00</nfe:ValorTotal>
            <nfe:NomeCliente>Empresa Exemplo Ltda</nfe:NomeCliente>
            <nfe:CNPJCliente>12345678901234</nfe:CNPJCliente>
            <nfe:Itens>
               <nfe:Item>
                  <nfe:Descricao>Produto Exemplo A</nfe:Descricao>
                  <nfe:Quantidade>2</nfe:Quantidade>
                  <nfe:ValorUnitario>250.00</nfe:ValorUnitario>
               </nfe:Item>
            </nfe:Itens>
         </nfe:InformacoesNotaFiscal>
      </nfe:EmissaoNotaFiscalRequest>
   </soapenv:Body>
</soapenv:Envelope>
